{
	"name": "Unite the Right rally",
	"location": "Charlottesville, Virginia",
	"date": "August 11, 2017",
	"description": "The Unite the Right rally was a white supremacist rally that occurred in Charlottesville, Virginia, from August 11 to 12, 2017. Protesters were members of the far-right and included self-identified members of the alt-right,[11] neo-Confederates,[12] neo-fascists,[13] white nationalists,[14] neo-Nazis,[15] Klansmen,[16] and various right-wing militias.[17] The marchers chanted racist and antisemitic slogans, carried semi-automatic rifles, Nazi and neo-Nazi symbols (such as the swastika, Odal rune, Black Sun, and Iron Cross), the Valknut, Confederate battle flags, Deus Vult crosses, flags and other symbols of various past and present anti-Muslim and antisemitic groups.[18][8][9][19][20][21][22] Within the Charlottesville area, the rally is often known as A12[23] or 8/12.[24] The organizers' stated goals included unifying the American white nationalist movement[11] and opposing the removal of the statue of Robert E. Lee from Charlottesville's Lee Park. \r\nPresident Donald Trump's remarks on Charlottesville received substantial negative attention. In his initial statement on the rally, Trump did not denounce the marchers explicitly, instead condemning 'hatred, bigotry, and violence on many sides'. While Trump later stated that he condemned neo-Nazis and white nationalists,[31] his first statement and his subsequent defenses of it, in which he also referred to 'very fine people on both sides', were seen by critics as implying moral equivalence between the white supremacist marchers and those who protested against them, and were interpreted by some as a sign that he was sympathetic to white supremacy.[8] The rally and surrounding clashes triggered a backlash against white supremacist groups in the United States. A number of groups that participated in the rally had events canceled by universities and their financial and social media accounts closed by major companies.[32] Some Twitter users led a campaign to identify and publicly shame marchers at the rally from photographs; at least one rally attendee was dismissed from his job as a result of the campaign.",
	"totalheads": 30
}